# POSTEST 2 DATASET


Lidya Simanungkalit

2009106125


Kecerdasan Buatan C1 20

# Import Library

In [62]:
import numpy as np
import pandas as pd
from tabulate import tabulate

# Menampilkan Data Set

In [63]:
dataset = pd.read_csv('usa_county_wise.csv')
dataset

,Unnamed: 0,UID,code3,FIPS,Lat,Long_,Confirmed,Deaths
0,0,16,16,60.0,-14.271000,-170.132000,0,0
1,1,316,316,66.0,13.444300,144.793700,0,0
2,2,580,580,69.0,15.097900,145.673900,0,0
3,3,63072001,630,72001.0,18.180117,-66.754367,0,0
4,4,63072003,630,72003.0,18.360255,-67.175131,0,0
...,...,...,...,...,...,...,...,...
627915,627915,84070016,840,NaN,39.372319,-111.575868,347,1
627916,627916,84070017,840,NaN,38.996171,-110.701396,70,0
627917,627917,84070018,840,NaN,37.854472,-111.441876,2781,23
627918,627918,84070019,840,NaN,40.124915,-109.517442,142,0
627919,627919,84070020,840,NaN,41.271160,-111.914512,2375,24

# informasi Data Set

In [64]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 627920 entries, 0 to 627919
Data columns (total 8 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   Unnamed: 0  627920 non-null  int64
 1   UID         627920 non-null  int64
 2   code3       627920 non-null  int64
 3   FIPS        626040 non-null  float64
 4   Lat         627920 non-null  float64
 5   Long_       627920 non-null  float64
 6   Confirmed   627920 non-null  int64
 7   Deaths      627920 non-null  int64
dtypes: float64(3), int64(5)
memory usage: 38.3 MB

# MENAMPILKAN JUMLAH RECORD

In [65]:
jumlah_record = len(dataset.index)
print ("jumlah recordnya yaitu", jumlah_record)

jumlah recordnya yaitu 627920

# MENAMPILKAN NAMA ATRIBUTE

In [66]:
data_atribut = list(dataset.columns)
nama_atribut = "\n".join(data_atribut)
print ("Nama-Nama Atributnya : \n", nama_atribut)

Nama-Nama Atributnya :
 Unnamed: 0
UID
code3
FIPS
Lat
Long_
Confirmed
Deaths

# MENAMPILKAN JUMLAH ATRIBUT

In [67]:
jmlh_atribut = dataset.shape[1]
print("JUMLAH ATRIBUTNYA", jmlh_atribut)

JUMLAH ATRIBUTNYA 8

# MENAMPILKAN ATRIBUTE DENGAN TYPE OBJEK

In [68]:
type_objek = len(dataset.dtypes[dataset.dtypes == "object"])
print ("JUMLAH ATRIBUTE DENGAN TYPE OBJEK ADALAH : ",type_objek)

JUMLAH ATRIBUTE DENGAN TYPE OBJEK ADALAH :  0

# MENAMPILKAN ATRIBUTE DENGAN TYPE ANGKA

In [69]:
Int = len(dataset.dtypes[dataset.dtypes == 'int64'])
Float = len(dataset.dtypes[dataset.dtypes == 'float64'])
type_angka = Int + Float
print ("JUMLAH ATRIBUT DENGAN TYPE ANGKA ADALAH:", type_angka)

JUMLAH ATRIBUT DENGAN TYPE ANGKA ADALAH: 8

# JUMLAH ATRIBUT YANG MEMILIKI NILAI NULL

In [70]:
Null = dataset.isnull().any().sum()
print ("JUMLAH ATRIBUTE YANG MEMILIKI NILAI NULL ADALAH: ", Null)

JUMLAH ATRIBUTE YANG MEMILIKI NILAI NULL ADALAH:  1

# MENAMPILKAN DALAM DICTIONARY

In [71]:
Dict ={
    "Jumlah record " : [jumlah_record],
    "Jumlah kolom" : [jmlh_atribut],
    "Nama atribute" : [ nama_atribut],
    "Atribut type objek" : [type_objek],
    "Atribut type angka" : [type_angka],
    "Atribut nilai NULL " : [Null]}
tabel = pd.DataFrame(Dict)
print(tabulate(tabel, headers ='keys', tablefmt ='psql', showindex =False))

+------------------+----------------+-----------------+----------------------+----------------------+-----------------------+
|   Jumlah record  |   Jumlah kolom | Nama atribute   |   Atribut type objek |   Atribut type angka |   Atribut nilai NULL  |
|------------------+----------------+-----------------+----------------------+----------------------+-----------------------|
|           627920 |              8 | Unnamed: 0      |                    0 |                    8 |                     1 |
|                  |                | UID             |                      |                      |                       |
|                  |                | code3           |                      |                      |                       |
|                  |                | FIPS            |                      |                      |                       |
|                  |                | Lat             |                      |                      |                       |
|                  |                | Long_           |                      |                      |                       |
|                  |                | Confirmed       |                      |                      |                       |
|                  |                | Deaths          |                      |                      |                       |
+------------------+----------------+-----------------+----------------------+----------------------+-----------------------+

# Menampilkan Rata-Rata, Standar Deviasi, Nilai Minimum,Nilai Maksimum, Q1,Q2, dan Q3 dari Atribute bertype Angka

In [72]:
desc = dataset.describe()
desc.rename(index= {"count": "jumlah data","Mean" :"Rata-Rat", "std":"Standar Deviasi","min" : "Nilai Minimum",
                    "25%": "Q1","50%": "Q2", "75%": "Q3","max" : "Nilai Maksimal"},inplace = True)
desc

,Unnamed: 0,UID,code3,FIPS,Lat,Long_,Confirmed,Deaths
jumlah data,627920.000000,6.279200e+05,627920.000000,626040.000000,627920.000000,627920.000000,627920.000000,627920.000000
mean,313959.500000,8.342958e+07,834.491617,33061.684685,36.707212,-88.601474,357.284285,17.536328
Standar Deviasi,181265.034852,4.314702e+06,36.492620,18636.156825,9.061572,21.715747,3487.282694,300.991466
Nilai Minimum,0.000000,1.600000e+01,16.000000,60.000000,-14.271000,-174.159600,0.000000,0.000000
Q1,156979.750000,8.401811e+07,840.000000,19079.000000,33.895587,-97.790204,0.000000,0.000000
Q2,313959.500000,8.402921e+07,840.000000,31014.000000,38.002344,-89.486710,4.000000,0.000000
Q3,470939.250000,8.404612e+07,840.000000,47131.000000,41.573069,-82.311265,63.000000,1.000000
Nilai Maksimal,627919.000000,8.410000e+07,850.000000,99999.000000,69.314792,145.673900,224051.000000,23500.000000

# MENAMPILKAN  NILAI KOLERASI

In [73]:
dataset.corr()

,Unnamed: 0,UID,code3,FIPS,Lat,Long_,Confirmed,Deaths
Unnamed: 0,1.000000,0.001225,0.001297,0.004205,-0.000527,0.001184,0.100452,0.052653
UID,0.001225,1.000000,0.903836,-0.198912,0.314965,-0.235989,0.012601,0.007961
code3,0.001297,0.903836,1.000000,-0.265912,0.341832,-0.195156,0.013792,0.008742
FIPS,0.004205,-0.198912,-0.265912,1.000000,-0.453129,0.483018,-0.026350,-0.010410
Lat,-0.000527,0.314965,0.341832,-0.453129,1.000000,-0.721129,0.010885,0.013868
Long_,0.001184,-0.235989,-0.195156,0.483018,-0.721129,1.000000,0.013257,0.021035
Confirmed,0.100452,0.012601,0.013792,-0.026350,0.010885,0.013257,1.000000,0.898629
Deaths,0.052653,0.007961,0.008742,-0.010410,0.013868,0.021035,0.898629,1.000000

# MENGUBAH ATRIBUTE BERTIPE ANGKA MENJADI DESIMAL 3 ANGKA DI BELAKANG KOMA

In [74]:
dataset['Deaths']*0.001

0         0.000
1         0.000
2         0.000
3         0.000
4         0.000
          ...
627915    0.001
627916    0.000
627917    0.023
627918    0.000
627919    0.024
Name: Deaths, Length: 627920, dtype: float64

# MENAMPILKAN 10 RECORD PERTAMA DARI ATRIBUTE BERTIPE ANGKA

In [75]:
numerics = [ 'int64', 'float64']
angka = dataset.select_dtypes(include=numerics).copy()
angka.head(10)

,Unnamed: 0,UID,code3,FIPS,Lat,Long_,Confirmed,Deaths
0,0,16,16,60.0,-14.271000,-170.132000,0,0
1,1,316,316,66.0,13.444300,144.793700,0,0
2,2,580,580,69.0,15.097900,145.673900,0,0
3,3,63072001,630,72001.0,18.180117,-66.754367,0,0
4,4,63072003,630,72003.0,18.360255,-67.175131,0,0
5,5,63072005,630,72005.0,18.459681,-67.120815,0,0
6,6,63072007,630,72007.0,18.251619,-66.126806,0,0
7,7,63072009,630,72009.0,18.131361,-66.264131,0,0
8,8,63072011,630,72011.0,18.287985,-67.120611,0,0
9,9,63072013,630,72013.0,18.406631,-66.675077,0,0

# MENYIMPAN DATASET DENGAN ATRIBUTRE BERTYPE ANGKA KEDALAM FILE CSV

In [76]:
angka.to_csv('usa_county_wise_Angka.csv')